/*
*******************************************************************************
*                  深圳市安保科技有限公司开发部                     
*                      Ambulanc Tech Co., Ltd                       
*            Copyright (C) 2009, All Rights Reserved                
*                                                                   
* 模块名称: Uart.c
* 摘    要: STM32F10X串口驱动程序头文件
*
* 当前版本: 1.0
* 作    者: 黎明
* 完成日期: 2013-11-08
* 内    容:
* 注    意: none                                                                  
*******************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*******************************************************************************
*/
#ifndef _USART_H
#define _USART_H

#include  "includes.h"
/*
*******************************************************************************
*                               包含头文件
*******************************************************************************
*/



/*
********************************************************************************
*                               宏定义
********************************************************************************
*/
#define DEF_UART_COM1   0
#define DEF_UART_COM2   1
#define DEF_UART_COM3   2
#define DEF_UART_COM4   3
#define DEF_UART_COM5   4
#define DEF_UART_COM6   5

/*
********************************************************************************
*                               外部函数声明
********************************************************************************
*/
extern void UART_Config(void);
extern void UART_Write(uint8_t com, uint8_t *data, uint16_t size);
extern uint8_t UART_Bind(uint8_t com, void (*receive)(uint8_t, uint8_t));

#endif /*_USART_H*/
