
/*
*******************************************************************************
*                  深圳市安保科技有限公司开发部                     
*                      Ambulanc Tech Co., Ltd                       
*            Copyright (C) 2009, All Rights Reserved                
*                                                                   
* 模块名称: Monitoring.h
* 摘    要: 监测模块程序头文件
*
* 当前版本: 1.0
* 作    者: 曾健
* 完成日期: 2015-09-03
* 内    容:
* 注    意: none                                                                   
*******************************************************************************
*/
#ifndef _MONITOR_H
#define _MONITOR_H

/*
*******************************************************************************
*                               包含头文件
*******************************************************************************
*/
#include "includes.h"
/*
********************************************************************************
*                               宏定义
********************************************************************************
*/
/*
********************************************************************************
*                               接口函数
********************************************************************************
*/
extern void MONITOR_Exec(void);
extern void MONITOR_SetSoundDisable(void);
extern INT8U MONITOR_GetFiO2Value(void);
extern INT8U MONITOR_GetPawValue(void);
extern INT8U MONITOR_Version(void);
#endif 



