/*
*******************************************************************************
*                  深圳市安保科技有限公司开发部                     
*                      Ambulanc Tech Co., Ltd                       
*            Copyright (C) 2009, All Rights Reserved                
*                                                                   
* 模块名称: PAW.h
* 摘    要: PAW驱动头文件
*
* 当前版本: 1.0
* 作    者: 曾健
* 完成日期: 2015-8-28
* 内    容:
* 注    意: none                                                                   
*******************************************************************************
*/
#ifndef _PAW_H
#define _PAW_H
/*
*******************************************************************************
*                               包含头文件
*******************************************************************************
*/
/*
********************************************************************************
*                               宏定义
********************************************************************************
*/
/*       气道压LED控制                         */
#define          DEF_CTR_PRE_LED_PORT            (GPIOC)
#define          DEF_CTR_PRE_LED_PIN             (GPIO_Pin_0)

#define DEF_PAW_LED_OFF   0
#define DEF_PAW_LED_ON    1

#define DEF_PAW_HIGH_LED    0
#define DEF_PAW_LOW_LED     14
/*
********************************************************************************
*                               接口函数
********************************************************************************
*/
extern void PAW_LedConfig(void);
extern void PAW_LedSet(INT32U num);
extern void PAW_LedSetOne(INT32U num, INT8U status);
extern void PAW_LedSetAllOff(void);
#endif 
