/*
*******************************************************************************
*                  深圳市安保科技有限公司开发部                     
*                      Ambulanc Tech Co., Ltd                       
*            Copyright (C) 2009, All Rights Reserved                
*                                                                   
* 模块名称: Led.h
* 摘    要: LedSTM32F10XX驱动头文件
*
* 当前版本: 1.0
* 作    者: 曾健
* 完成日期: 2015-9-15
* 内    容:
* 注    意: none                                                                   
*******************************************************************************
*/
#ifndef _CALIBRATION_H
#define _CALIBRATION_H
/*
*******************************************************************************
*                               宏
*******************************************************************************
*/
#define DEF_CAL_ON  1
#define DEF_CAL_OFF 0

#define DEF_CAL_FIO2 1
#define DEF_CAL_PAW  2
/*
********************************************************************************
*                               接口函数
********************************************************************************
*/
extern void CALIBRATION_Exec(void);
extern INT8U CALIBRATION_IsAdj(void);
extern INT8U CALIBRATION_GetCalSucflag(void);
#endif 