/*
*******************************************************************************
*                  深圳市安保科技有限公司开发部                     
*                      Ambulanc Tech Co., Ltd                       
*            Copyright (C) 2009, All Rights Reserved                
*                                                                   
* 模块名称: includes.c
* 摘    要: 主头文件
*
* 当前版本: 1.0
* 作    者: 曾健
* 完成日期: 2015-08-28
* 内    容:
* 注    意: none                                                                  
*******************************************************************************
* 取代版本: 
* 作    者:
* 完成日期: 
* 修改内容:
* 修改文件: 
*******************************************************************************
*/

#ifndef  _INCLUDE_H
#define  _INCLUDE_H        

/*
*******************************************************************************
*                               库头文件
*******************************************************************************
*/
#include  <stdarg.h>
#include  <stdio.h>
#include  <stdlib.h>
#include  <string.h>
#include  <math.h>

#include  <lib_def.h>
#include  <lib_ascii.h>
#include  <lib_mem.h>
#include  <lib_str.h>

/*
*******************************************************************************
*                               uCosII头文件
*******************************************************************************
*/
#include  <ucos_ii.h>

/*
*******************************************************************************
*                               驱动头文件
*******************************************************************************
*/
#include "Bsp.h"
#include "Uart.h"
#include "Key.h"
#include "Led.h"
#include "Power.h"
#include "Oled.h"
#include "Paw.h"
#include "Buzzer.h"
#include "TIME_Timer.h"
#include "i2c_ee.h"
/*
*******************************************************************************
*                               宏文件
*******************************************************************************
*/
/*
    Define Debug function
*/
#define DEF_DEBUG_EN 1u

static void DebugPrintf(const char *str)
{
  
}

#if DEF_DEBUG_EN > 0u
#define Debug printf
#else
#define Debug
#endif

#endif

